Hi folks 👋 It seems my note above was only partially correct, however I can confirm this is resolved in Terraform 0.12, which supports new functionality in the configuration language aimed at solving this issue. The new [`dynamic` block syntax](https://www.terraform.io/docs/configuration/expressions.html#dynamic-blocks) can be used to dynamically generate configuration blocks and their arguments. These can be combined with the new [`null` value](https://www.terraform.io/docs/configuration/expressions.html#null), which can be used to omit arguments as if they were not defined in the configuration at all.

Given this configuration:

```hcl
terraform {
  required_providers {
    aws = "2.20.0"
  }
  required_version = "0.12.5"
}

provider "aws" {
  region = "us-east-1"
}

variable "test1" {
  type = list(object({
    variables = map(string)
  }))
  default = []
}

variable "test2" {
  type = list(object({
    variables = map(string)
  }))
  default = [{
    variables = {
      key1 = "value1"
      key2 = "value2"
    }
  }]
}

resource "aws_iam_role" "test" {
  assume_role_policy = jsonencode({
    Version = "2012-10-17"
    Statement = [{
      Action = "sts:AssumeRole"
      Principal = {
        Service = "lambda.amazonaws.com"
      }
      Effect = "Allow"
      Sid    = ""
    }]
  })
}

resource "aws_iam_role_policy_attachment" "test" {
  policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
  role       = aws_iam_role.test.name
}

resource "aws_lambda_function" "test1" {
  depends_on = [aws_iam_role_policy_attachment.test]

  filename      = "test.zip"
  function_name = "test1"
  role          = aws_iam_role.test.arn
  handler       = "exports.example"
  runtime       = "nodejs8.10"

  dynamic "environment" {
    for_each = var.test1

    content {
      variables = environment.value.variables
    }
  }
}

resource "aws_lambda_function" "test2" {
  depends_on = [aws_iam_role_policy_attachment.test]

  filename      = "test.zip"
  function_name = "test2"
  role          = aws_iam_role.test.arn
  handler       = "exports.example"
  runtime       = "nodejs8.10"

  dynamic "environment" {
    for_each = var.test2

    content {
      variables = environment.value.variables
    }
  }
}
```

Produces the following apply output:

```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.test will be created
  + resource "aws_iam_role" "test" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.test will be created
  + resource "aws_iam_role_policy_attachment" "test" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_lambda_function.test1 will be created
  + resource "aws_lambda_function" "test1" {
      + arn                            = (known after apply)
      + filename                       = "test.zip"
      + function_name                  = "test1"
      + handler                        = "exports.example"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs8.10"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.test2 will be created
  + resource "aws_lambda_function" "test2" {
      + arn                            = (known after apply)
      + filename                       = "test.zip"
      + function_name                  = "test2"
      + handler                        = "exports.example"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs8.10"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "key1" = "value1"
              + "key2" = "value2"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_role.test: Creating...
aws_iam_role.test: Creation complete after 0s [id=terraform-20190724062422187100000001]
aws_iam_role_policy_attachment.test: Creating...
aws_iam_role_policy_attachment.test: Creation complete after 0s [id=terraform-20190724062422187100000001-20190724062422605200000002]
aws_lambda_function.test2: Creating...
aws_lambda_function.test1: Creating...
aws_lambda_function.test2: Still creating... [10s elapsed]
aws_lambda_function.test1: Still creating... [10s elapsed]
aws_lambda_function.test1: Creation complete after 16s [id=test1]
aws_lambda_function.test2: Creation complete after 17s [id=test2]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

There may be ways to simplify this setup, but from a functionality standpoint, the relevant pieces are in place. Enjoy! 🚀 